[
  {
  "bookId": 1,
  "bookName": "The Great Gatsby",
  "author": "F. Scott Fitzgerald",
  "image": "https://i.ibb.co/xsPTR28/p1.png",
  "review": "The Great Gatsby is a timeless classic that vividly captures the decadence and disillusionment of the Jazz Age. Through the eyes of narrator Nick Carraway, readers are drawn into the extravagant world of Jay Gatsby, a mysterious millionaire with a past shrouded in secrets. As the story unfolds, themes of love, ambition, and the pursuit of the American Dream intertwine with tales of wealth, excess, and moral decay. Fitzgerald's elegant prose and keen insights into human nature make this novel a compelling exploration of the highs and lows of the Roaring Twenties.",
  "totalPages": 180,
  "rating": 4.5,
  "category": "Classic Literature",
  "tags": ["Classic", "Romance"],
  "publisher": "Charles Scribner's Sons",
  "yearOfPublishing": 1925
  },
  {
  "bookId": 2,
  "bookName": "1984",
  "author": "George Orwell",
  "image": "https://i.ibb.co/8d53gpX/p2.png",
  "review": "George Orwell's 1984 is a chilling dystopian masterpiece that continues to resonate with readers around the world. Set in a totalitarian society where Big Brother watches every move, the novel follows protagonist Winston Smith as he rebels against the oppressive regime of the Party. Through Winston's eyes, readers are confronted with the horrors of surveillance, propaganda, and thought control, prompting reflection on the nature of power, truth, and individual freedom. Orwell's prophetic vision and haunting portrayal of a dystopian future make 1984 a timeless warning against the dangers of authoritarianism and the erosion of civil liberties.",
  "totalPages": 328,
  "rating": 4.7,
  "category": "Dystopian Fiction",
  "tags": ["Dystopian", "Political"],
  "publisher": "Secker & Warburg",
  "yearOfPublishing": 1949
  },
  {
  "bookId": 3,
  "bookName": "To Kill a Mockingbird",
  "author": "Harper Lee",
  "image": "https://i.ibb.co/ZfK4LY5/p3.png",
  "review": "Harper Lee's To Kill a Mockingbird is a timeless classic that tackles themes of racial injustice, morality, and compassion in the American South. Set in the 1930s, the novel follows young Scout Finch as she navigates the complexities of her small town and witnesses her father, Atticus Finch, defend a black man falsely accused of rape. Through Scout's innocent yet perceptive perspective, Lee explores the ugliness of prejudice and the power of empathy, leaving readers with a poignant reminder of the importance of standing up for what is right, even in the face of adversity.",
  "totalPages": 281,
  "rating": 4.8,
  "category": "Legal Drama",
  "tags": ["Classic", "Legal Drama"],
  "publisher": "J. B. Lippincott & Co.",
  "yearOfPublishing": 1960
  },
  {
  "bookId": 4,
  "bookName": "The Catcher in the Rye",
  "author": "J.D. Salinger",
  "image": "https://i.ibb.co/2tVpMFK/p4.png",
  "review": "J.D. Salinger's The Catcher in the Rye is a provocative coming-of-age novel that continues to resonate with readers of all ages. Narrated by the disillusioned teenager Holden Caulfield, the novel offers a raw and unfiltered glimpse into the mind of an adolescent grappling with alienation, identity, and the phoniness of the adult world. As Holden embarks on a journey of self-discovery through the streets of New York City, readers are invited to confront the universal struggles of adolescence and the search for authenticity in a world filled with hypocrisy and disillusionment.",
  "totalPages": 224,
  "rating": 4.3,
  "category": "Coming-of-Age Fiction",
  "tags": ["Coming-of-Age", "Existential"],
  "publisher": "Little, Brown and Company",
  "yearOfPublishing": 1951
  },
  {
  "bookId": 5,
  "bookName": "Pride and Prejudice",
  "author": "Jane Austen",
  "image": "https://i.ibb.co/93qVgnr/p5.png",
  "review": "Jane Austen's Pride and Prejudice is a delightful romance novel that continues to captivate readers with its wit, charm, and social satire. Set in early 19th-century England, the novel follows the spirited Elizabeth Bennet as she navigates the complexities of love and marriage in a society governed by strict social conventions. As Elizabeth clashes with the proud and enigmatic Mr. Darcy, readers are treated to a witty and engaging exploration of misunderstandings, first impressions, and the transformative power of love. With its timeless themes and memorable characters, Pride and Prejudice remains a beloved classic that enchants readers of every generation.",
  "totalPages": 279,
  "rating": 4.6,
  "category": "Romantic Fiction",
  "tags": ["Romance", "Satire"],
  "publisher": "T. Egerton, Whitehall",
  "yearOfPublishing": 1813
  },
  {
  "bookId": 6,
  "bookName": "The Hobbit",
  "author": "J.R.R. Tolkien",
  "image": "https://i.ibb.co/PztL7rX/p6.png",
  "review": "J.R.R. Tolkien's The Hobbit is a timeless fantasy adventure that transports readers to the enchanting world of Middle-earth. Bilbo Baggins, a reluctant hobbit, is swept into an epic quest to reclaim the lost kingdom of Erebor from the fearsome dragon Smaug. Joined by a band of dwarves and the wise wizard Gandalf, Bilbo embarks on a journey fraught with danger, discovery, and magic. As they encounter trolls, goblins, and other fantastical creatures, readers are drawn into a richly imagined world filled with heroism, friendship, and the enduring power of courage. With its captivating storytelling and vivid imagery, The Hobbit continues to captivate readers of all ages, inspiring generations with its timeless tale of adventure and redemption.",
  "totalPages": 310,
  "rating": 4.9,
  "category": "Fantasy",
  "tags": ["Fantasy", "Adventure"],
  "publisher": "Allen & Unwin",
  "yearOfPublishing": 1937
  },
  {
      "bookId": 7,
      "bookName": "The Lord of the Rings",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/TqkkDJc/p7.png",
      "review": "J.R.R. Tolkien's The Lord of the Rings is an epic fantasy masterpiece that continues to enchant readers with its sweeping scope, rich mythology, and timeless themes. Set in the fictional world of Middle-earth, the trilogy follows the perilous journey of Frodo Baggins and his companions as they seek to destroy the One Ring and defeat the dark lord Sauron. Along the way, they encounter allies and adversaries, face unimaginable challenges, and confront the ultimate test of courage and sacrifice. Tolkien's masterful storytelling, intricate world-building, and profound exploration of good versus evil make The Lord of the Rings a literary classic that resonates with readers of all ages.",
      "totalPages": 400,
      "rating": 4.8,
      "category": "Epic Fantasy",
      "tags": ["Fantasy", "Adventure"],
      "publisher": "Allen & Unwin",
      "yearOfPublishing": 1954
    },
    {
      "bookId": 8,
      "bookName": "Harry Potter and the Sorcerer's Stone",
      "author": "J.K. Rowling",
      "image": "https://i.ibb.co/pPc03Lm/p8.png",
      "review": "J.K. Rowling's Harry Potter and the Sorcerer's Stone is a magical tale of friendship, courage, and the power of imagination. The story follows young Harry Potter as he discovers his true identity as a wizard and embarks on a journey to Hogwarts School of Witchcraft and Wizardry. Alongside his loyal friends Ron and Hermione, Harry navigates the challenges of school, uncovers the mysteries of his past, and confronts the dark wizard Voldemort. With its enchanting world-building, engaging characters, and compelling narrative, Harry Potter and the Sorcerer's Stone captivates readers with its blend of humor, adventure, and heartwarming moments.",
      "totalPages": 309,
      "rating": 4.7,
      "category": "Young Adult Fantasy",
      "tags": ["Fantasy", "Magic"],
      "publisher": "Bloomsbury",
      "yearOfPublishing": 1997
    },
    {
      "bookId": 9,
      "bookName": "The Hunger Games",
      "author": "Suzanne Collins",
      "image": "https://i.ibb.co/PGbFPsy/p9.png",
      "review": "Suzanne Collins' The Hunger Games is a gripping dystopian novel that immerses readers in a world of oppression, survival, and rebellion. Set in the ruins of North America, the story unfolds in the totalitarian nation of Panem, where the Capitol holds absolute power over twelve districts. As punishment for a past uprising, the Capitol hosts the annual Hunger Games, a televised event where teenagers from each district fight to the death. Through the eyes of protagonist Katniss Everdeen, readers experience the brutality of the Games and the resilience of the human spirit in the face of adversity. Collins' thought-provoking narrative, compelling characters, and fast-paced action make The Hunger Games a must-read for fans of dystopian fiction.",
      "totalPages": 374,
      "rating": 4.5,
      "category": "Young Adult Dystopian",
      "tags": ["Dystopian", "Adventure"],
      "publisher": "Scholastic Press",
      "yearOfPublishing": 2008
    }
  ]